ErpTest/src/Documents/НачислениеСписаниеРезервовПредстоящихРасходов/НачислениеСписаниеРезервовПредстоящихРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеСписаниеРезервовПредстоящихРасходов</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.РезервыПредстоящихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРезервов</name>
    <type>
      <types>CatalogRef.Резервы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Резервы</name>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектУчетаРезервов</name>
      <type>
        <types>CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСуммаРегл</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСуммаУпр</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановитьНовуюСуммуРегл</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяСуммаРегл</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановитьНовуюСуммаУпр</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяСуммаУпр</name>
      <type>
        <types>DefinedType.ДенежноеПолеНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеНачисления</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельностиНачисления</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовНачисления</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходовНачисления</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеСписания</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельностиСписания</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходовСписания</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаДоходовСписания</name>
      <type>
        <types>Characteristic.СтатьиДоходов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/AccumulationRegisters/РезервыПредстоящихРасходов/РезервыПредстоящихРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыПредстоящихРасходов</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРезервов</name>
    <type>
      <types>CatalogRef.Резервы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектУчетаРезервов</name>
    <type>
      <types>CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/Documents/НачислениеСписаниеРезервовПредстоящихРасходов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.НачислениеСписаниеРезервовПредстоящихРасходов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДоходыИРасходыСервер.ОтразитьПрочиеДоходы(ДополнительныеСвойства, Движения, Отказ);
	ДоходыИРасходыСервер.ОтразитьПрочиеРасходы(ДополнительныеСвойства, Движения, Отказ);	
	РегистрыНакопления.РезервыПредстоящихРасходов.ОтразитьРезервыПредстоящихРасходов(ДополнительныеСвойства, Движения, Отказ);

	//++ НЕ УТ
	РеглУчетПроведениеСервер.ЗарегистрироватьКОтражению(ЭтотОбъект, ДополнительныеСвойства, Движения, Отказ);
	//-- НЕ УТ	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	//++ НЕ УТКА
	МеждународныйУчетПроведениеСервер.ЗарегистрироватьКОтражению(ЭтотОбъект, ДополнительныеСвойства, Движения, Отказ);
	//-- НЕ УТКА
	
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
		
	Если МассивНепроверяемыхРеквизитов.Найти("Резервы.АналитикаРасходовНачисления") = Неопределено Тогда
		ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
			ЭтотОбъект, Новый Структура("Резервы", "СтатьяРасходовНачисления, АналитикаРасходовНачисления"), МассивНепроверяемыхРеквизитов, Отказ);
	КонецЕсли;
	
	Если МассивНепроверяемыхРеквизитов.Найти("Резервы.АналитикаДоходовСписания") = Неопределено Тогда
		ПланыВидовХарактеристик.СтатьиДоходов.ПроверитьЗаполнениеАналитик(
			ЭтотОбъект, Новый Структура("Резервы", "СтатьяДоходовСписания, АналитикаДоходовСписания"), МассивНепроверяемыхРеквизитов, Отказ);
	КонецЕсли;
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	// Запись наборов записей
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Дата = КонецМесяца(Дата);

	// Проверим, что в этом месяце больше нет аналогичных документов:
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НачислениеСписаниеРезервовПредстоящихРасходов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.НачислениеСписаниеРезервовПредстоящихРасходов КАК НачислениеСписаниеРезервовПредстоящихРасходов
		               |ГДЕ
		               |	НачислениеСписаниеРезервовПредстоящихРасходов.Ссылка <> &Ссылка
		               |	И НАЧАЛОПЕРИОДА(НачислениеСписаниеРезервовПредстоящихРасходов.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
		               |	И НачислениеСписаниеРезервовПредстоящихРасходов.Организация = &Организация
		               |	И НачислениеСписаниеРезервовПредстоящихРасходов.ВидРезервов = &ВидРезервов
		               |	И НачислениеСписаниеРезервовПредстоящихРасходов.Проведен";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ВидРезервов", ВидРезервов);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ТекстСообщения = НСтр("ru = 'По организации ""%1"" с видом резервов ""%2"" за ""%3"" месяц уже оформлен документ ""%4"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Организация, ВидРезервов, Формат(Дата, "ДФ='ММММ'"), Выборка.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Дата") Тогда
			ЭтотОбъект.Дата = ДанныеЗаполнения.Дата;
		КонецЕсли;
		СтруктураПроверки = Новый Структура("Организация, ВидРезервов");
		ЗаполнитьЗначенияСвойств(СтруктураПроверки, ДанныеЗаполнения);
		Если ЗначениеЗаполнено(СтруктураПроверки.Организация) И ЗначениеЗаполнено(СтруктураПроверки.ВидРезервов) Тогда
			Резервы.Загрузить(Документы.НачислениеСписаниеРезервовПредстоящихРасходов.ДанныеДляЗаполненияРезервов(ЭтотОбъект).Выгрузить());
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
